Revit 2027 API
ExternalFileReference.PathType Property
 The path type of the link (relative, absolute, or server).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PathType PathType { get; }
Public ReadOnly Property PathType As PathType
	Get
public:
property PathType PathType {
	PathType get ();
}
member PathType : PathType with get
Property Value
PathType
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace